// // Завдання 1
// // Напиши функцію logItems(array), яка отримує масив і використовує цикл for, який для кожного елемента масиву буде виводити в консоль
// //  повідомлення в форматі [номер елемента] - [значення елемента].
// // Нумерація повинна починатися з 1. Наприклад, для першого елемента масиву ['Mango', 'Poly', 'Ajax']
// //  з індексом 0 буде виведено '1 - Mango', а для індексу 2 виведе '3 - Ajax'.
// const logItems = function (array) {
//   for (let i = 0; i < array.length; i += 1) {
//     // console.log([номер елемента] - [значення елемента]);
//   }
// };

// logItems(["Mango", "Poly", "Ajax"]);

// // Завдання 2
// // Напиши скрипт підрахунку вартості гравіювання прикрас.Для цього створи функцію calculateEngravingPrice(message, pricePerWord)
// //  приймаючу рядок(в рядку будуть тільки слова і прогалини) і ціну гравіювання одного слова, і повертає ціну гравіювання всіх
// // слів в рядку.
// const calculateEngravingPrice = function (message, pricePerWord) {
//   // 1. Перетворити рядок в масив
//   // 2. Порахувати кількість елементів в масиві(к-ть слів)
//   // 3. Порахувати ціну за фразу(помножити к-ть слів на ціну)
// };

// // const result = calculateEngravingPrice
// // console.log();

// // Завдання 3
// // Напиши функцію findLongestWord(string), яка приймає параметром довільний рядок(в рядку будуть тільки слова і прогалини)
// //  і повертає найдовше слово в цьому рядку.
// const findLongestWord = function (string) {
//   // 1. Перетворити рядок в масив
//   // 2. Пройтися циклом по масиву та зробити перевірку
//   // 3. Створити змінну яка буде зберігати перше припущення(наприклад зараз цей елемнт є найдовшим)
// };

// // Завдання 4
// // Напиши функцію formatString(string) яка приймає рядок і форматує його якщо необхідно.
// // Якщо довжина рядка не перевищує 40 символів, функція повертає її в початковому вигляді.
// // Якщо довжина більше 40 символів, то функція обрізає рядок до 40-ка символів і додає в кінець рядка три крапки '...',
// //  після чого повертає укорочену версію.
// const formatString = function (string) {
//   // 1. Зробити перевірку на довжину рядка, якщо менше 40 символів - повертати рядок; якщо більше 40 символів - треба обрізати за допомогу slice(початок і кінець)
//   // 2. В кінці додати 3 крапки, використати конкатинацію(+)
// };

// // Завдання 5
// // Напиши функцію checkForSpam(message), приймаючу 1 параметр message — рядок. Функція перевіряє її на вміст слів spam і sale.
// //  Якщо знайшли заборонене слово, то функція повертає true,
// //  якщо заборонених слів немає функція повертає false. Слова в рядку можуть бути в довільному регістрі.
// const checkForSpam = function (message) {
//   // 1. Перетворити фразу яку отримуєш в нижній регістр
//   // 2. Зробити перевірку за допомогою оператора "або" та метода includes і повернути "true або false"
// };

// // Завдання 6
// // Напиши скрипт з наступним функціоналом:
// //  При завантаженні сторінки користувачеві пропонується в prompt ввести число.
// //   Введення зберігається в змінну input і додається в масив чисел numbers.
// //    Операція введення числа користувачем і збереження в масив триває до тих пор, пір, поки користувач не натисне Cancel в prompt.
// //     Після того як користувач припинив введення натиснувши Cancel, якщо масив не порожній,
// //      необхідно порахувати суму всіх елементів масиву і записати її в змінну total.Використовуй цикл for або for...of.
// //       Після чого в консоль виведи рядок 'Загальна сума чисел дорівнює [сума]'.
// let input;
// const numbers = [];
// let total = 0;
// while (input !== null) {
//   input = prompt("Введіть число");
//   // 1. Зберегти число в масив numbers
// }

// // 2. Коли зупиниться дія циклу While необхідно порахувати суму всіх елементів масиву і записати її в змінну total.Використовуй цикл for або for...of.
// // 3.  Після чого в консоль виведи рядок 'Загальна сума чисел дорівнює [сума]'.

// Створити стрілкову функцію hello1(),
// яка при визові буде вертати текст “Привіт JavaScript”.
// const hello1 = () => {
//   return "Hello JavaSCript!";
// };
// console.log(hello1());

// const helloW = () => "Hello JavaSCript!";
// console.log(hello1());

/*   2.
Напишіть стрілкову функцію hello2(), 
яка при виклику буде приймати змінну userName 
(наприклад, «Василь») і виводити рядок 
(в нашому випадку «Привіт, Василь»). */

// const hello2 = (userName) => "Привіт, " + userName;
// console.log(hello2("Vasil"));
// console.log(hello2("Nazar"));
// console.log(hello2("Matviy"));
// console.log(hello2("Andriy"));

/*   3.
Напишіть стрілкову функцію mul(n, m), 
яка приймає два аргументи і 
повертає добуток, суму і різницю цих аргументів.
 Перевірте її роботу. */

// const mul = (n, m) => {
//   const multiply = n * m;
//   const total = n + m;
//   const difference = n - m;
//   return [multiply, total, difference];
// };

// console.log(mul(6, 6));

// const mul = (n, m) => [n * m, n + m, n - m];

// console.log(mul(6, 6));

/*   4.
Напиши стрілкову функцію myAverageScore , 
яка у якості аргументу отримує масив з оцінками, 
і виводить користувачу його середній результат 
у наступному форматі:

Averagescore: A (якщо середня оцінка від 91 до 100)
Average score: B (якщо середня оцінка від 81 до 90)
Average score: C (якщо середня оцінка від 71 до 80)
Average score: D (якщо середня оцінка від 70 і менше)
Для перевірки:*/
// console.log(myAverageScore([100, 75, 81, 96]));
// console.log(myAverageScore([45, 63, 85, 70]));

// const myAverageScore = (array) => {
//   let sum = 0;

//   for (const num of array) {
//     sum += num;
//   }

//   //   console.log(sum);

//   const average = sum / array.length;
//   //   console.log(average);

//   if (average >= 90 && average <= 100) {
//     return "AverageScore: A";
//   }

//   if (average >= 81 && average <= 90) {
//     return "AverageScore: B";
//   }

//   if (average >= 71 && average <= 80) {
//     return "AverageScore: C";
//   }

//   if (average <= 70 && average >= 0) {
//     return "AverageScore: D";
//   }

//   return "Incorrect";
// };

// console.log(myAverageScore([100, 75, 81, 96]));
// console.log(myAverageScore([45, 63, 85, 70]));

/*   2.
Напишіть функцію, яка повертає новий масив, 
в якому всі елементи масиву помножені на задане число,
 з використанням колбек-функції */

// const array = [1, 2, 3, 4, 5];

// const multiplyArray = (array, num, callback) => {
//   let newArray = [];
//   for (const element of array) {
//     let result = callback(num, element);
//     newArray.push(result);
//   }
//   return newArray;
// };
// const mull = (num, element) => num * element;
// console.log(multiplyArray(array, 2, mull));

// console.log(multiplyArray(array, 2, (num, element) => num + element));

// console.log(multiplyArray(array, 2, (num, element) => element / num));
